# ElementIntersectsElementFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIntersectsElementFilter Members
ElementIntersectsElementFilter Class Constructors Methods Properties See Also
---
The ElementIntersectsElementFilter type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementIntersectsElementFilter(Element) | Constructs a filter to match elements which intersect the given element. |
| ElementIntersectsElementFilter(Element, Boolean) | Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ElementFilter.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetElement | Gets the target element. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.  (Inherited from ElementFilter.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ElementFilter.) |

# See Also
ElementIntersectsElementFilter Class
Autodesk.Revit.DB Namespace